[
  {
    "id": 1,
    "title": "E-Teaching Mentoring Program",
    "description": "Mentoring is delivered as one-on-one meetings between the Mentor and the Mentee, focused on achieving mentoring goals agreed at the kick- off meeting.",
    "duration": 1300,
    "creationDate": "2019-2-28",
    "topRated": false
  },
  {
    "id": 2,
    "title": "EPAM eKids Program - Registration for kids",
    "description": "EPAM eKids program is a 12-weeks coding curriculum centered around the Scratch programming language. For advanced level groups (children 12+) we offer more complex languages: Python, JavaScript, Java, HTML, Unity. eKids help children to get practical knowledge of the programmer’s work, develop creative and engineer thinking.",
    "duration": 750,
    "creationDate": "2017-12-1",
    "topRated": true
  },
  {
    "id": 3,
    "title": "Basics of Online & Offline Presentation Excellence",
    "description": "This session satisfies all the basic needs of a presenter and a junior public speaker. The participants will study the core components of effective preparation and confident delivery in online and offline environment. Apart from studying different techniques, each participant will have the opportunity to practice and to receive a valuable feedback.",
    "duration": 960,
    "creationDate": "2020-6-18",
    "topRated": false
  },
  {
    "id": 4,
    "title": "TypeScript In-Depth",
    "description": "This training begins with TypeScript basics such as the new syntax for variable declarations and moves through all of the major features of the language including arrow functions, interfaces, classes, modules, namespaces, generics.",
    "duration": 50,
    "creationDate": "2025-4-1",
    "topRated": false
  },
  {
    "id": 5,
    "title": "Switch JS",
    "description": "A Program is aimed to help everyone in learning Javascript. During a limited period of time, we will provide support in learning JS, HTML, CSS, Typescript, passing interviews, etc. Program topics and duration are individual for each participant depends on his goals and initial JS level, which makes the educational process more efficient.",
    "duration": 1440,
    "creationDate": "2020-6-24",
    "topRated": true
  }
]
